AudioStreamingPlatform/hal_ti/mspm0/source/ti/drivers/uart/UARTMSP.h
/*
 * Copyright (c) 2021, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef ti_drivers_uart_UARTMSP__include
#define ti_drivers_uart_UARTMSP__include

#include <ti/devices/msp/msp.h>
#include <ti/drivers/uart/UARTSupport.h>

extern const UARTSupport_Fxns UARTMSPSupportFxns;

#ifdef __cplusplus
extern "C" {
#endif

typedef struct 
{
    UART_Object object;
    /*UART communication buffers and related parameters*/
    UART_Buffers_Object buffersObject; 
    /*UART communication related events*/
    UART_EventCallback_Object eventCallbackObject;  
    /*UART callback mode related parameters*/
    UART_Callback_Object callbackObject; 

    UART_Regs *regs;
    IRQn_Type irq;
    uint32_t rxPin;
    uint32_t rxPinFunction;
    uint32_t txPin;
    uint32_t txPinFunction;
    DL_UART_MODE mode;
    DL_UART_DIRECTION direction;
    DL_UART_FLOW_CONTROL flowControl;
    DL_UART_CLOCK clockSource;
    DL_UART_CLOCK_DIVIDE_RATIO clockDivider;
    DL_UART_RX_FIFO_LEVEL rxIntFifoThr;
    DL_UART_TX_FIFO_LEVEL txIntFifoThr;
} UARTMSP_HWAttrs;

void UARTMSP_interruptHandler(UARTMSP_HWAttrs *hwAttrs);

#ifdef __cplusplus
} /* extern "C" */
#endif

#endif /* ti_drivers_uart_UARTMSP__include */
